prof_repo/ProfilPortant/TD2_NACA_Profil/simpleFoam_alpha10/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    inlet
    {
        type        zeroGradient;
    }

    outlet
    {
        type        fixedValue;
        value       uniform $pressure;
    }

    wing
    {
        type        zeroGradient;
    }

    #include "include/frontBackTopBottomPatches"
}

// ************************************************************************* //
