prof_repo/ProfilPortant/TD2_NACA_Profil/simpleFoam_alpha10/0.orig/include/frontBackTopBottomPatches
// Conditions aux limites communes — inclus dans U, p, k, omega, nut

top
{
    type        slip;
}

bottom
{
    type        slip;
}

symFront
{
    type        empty;
}

symBack
{
    type        empty;
}
