prof_repo/ProfilPortant/TD2_NACA_Profil/simpleFoam_alpha10/0.orig/include/initialConditions
// Conditions initiales et paramètres d'entrée
// Modifiez ces valeurs pour changer les conditions de simulation

flowVelocity    (98.4807753 17.3648178 0);   // [m/s] — vitesse loin du profil à 10°
pressure        0;           // [Pa] — pression cinématique de référence

// Turbulence k-ω SST
// k = 1.5*(I*U)² avec I=0.01 (intensité turbulente 1%)
// ω = k^0.5 / (Cμ^0.25 * ℓ) avec Cμ=0.09, ℓ=0.07*c, c=1m
turbulentKE     1.5;          // [m²/s²]
turbulentOmega  32;          // [1/s]
